app/Controllers/Operator.php

SELECT *
FROM `driver`
---
	public function index(){
		$opermodel = new OperatorModel();
		$data['driver'] = $opermodel->findAll();