app/Controllers/Report.php

    public function index(){
		$db      = \Config\Database::connect();
		$builder = $db->table('report');
		$builder->orderBy('id','desc');
		$query= $builder->get();
---
SELECT *
FROM `report`
ORDER BY `id` DESC

	public function laporandetail()
	{
		$db      = \Config\Database::connect();
		$builder_project= $db->table('project');
		$project= $builder_project->get();

		$builder = $db->table('report');
		$databes= $builder->get();
		$builder->like('status','OPR');
		$opr= $builder->get();
		$builder->like('status','HMSI');
		$builder->like('status','SA');
		$builder->like('status','HONG');
		$breakdown= $builder->get();
		$builder->like('status','STB');
		$stb= $builder->get();
		$builder->like('status','TLO');
		$tlo= $builder->get();
		$builder->like('status','COM');
		$com= $builder->get();
		$builder->like('status','ACD');
		$acd= $builder->get();
---
SELECT *
FROM `project`
SELECT *
FROM `report`
SELECT *
FROM `report`
WHERE `status` LIKE '%OPR%' ESCAPE '!'
SELECT *
FROM `report`
WHERE `status` LIKE '%HMSI%' ESCAPE '!'
AND  `status` LIKE '%SA%' ESCAPE '!'
AND  `status` LIKE '%HONG%' ESCAPE '!'
SELECT *
FROM `report`
WHERE `status` LIKE '%HONG%' ESCAPE '!'
SELECT *
FROM `report`
WHERE `status` LIKE '%STB%' ESCAPE '!'
SELECT *
FROM `report`
WHERE `status` LIKE '%TLO%' ESCAPE '!'
SELECT *
FROM `report`
WHERE `status` LIKE '%COM%' ESCAPE '!'

		public function index_rfid(){
			$db      = \Config\Database::connect();
			$builder = $db->table('report_rfid');
			$builder->orderBy('id','desc');
			$query= $builder->get();
---
SELECT *
FROM `report_rfid`
ORDER BY `id` DESC