app/Controllers/Testing.php

SELECT *
FROM `report`
---
    public function index()
    {
        $reportModel = new ReportModel();
        $data['report'] = $reportModel->findAll();

SELECT *
FROM `report`
---
    public function cari()
    {
        $hasil= $this->request->getVar();
        $value=$hasil['cari'];
        // cariiiiiiiiiiiiiiiiiiiii

        $db      = \Config\Database::connect();
        $builder = $db->table('report');
        $query= $builder->like('id_unit', $value);
        $query= $builder->orLike('keterangan', $value);
        $query = $builder->get();

SELECT *
FROM `project`
---
    public function nestedloop()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('report');
        $data['report']= $builder->get()->getResult();
        $report= $db->table('project');
        $data['project']= $report->get()->getResult();

SELECT *
FROM `report`
WHERE `report`.`id` = '6'
INSERT INTO `transaksi` (`id_unit`, `idproject`, `keterangan`, `status`, `nama_user`, `id_transaksi`) VALUES ('260', '3', 'STANDBY', 'STB', 'dinand', 'inv-001')
---
    public function edit($id)
    {
        $reportModel = new ReportModel();
        $data= $reportModel->find($id);
        // dd($data);
        $databes= array(
            'id_unit'=> $data['id_unit'],
            'idproject'=> $data['idproject'],
            'keterangan'=> $data['keterangan'],
            'status'=> $data['status'],
            'nama_user'=> 'dinand',
            'id_transaksi'=> 'inv-001'
        );


        // testing untuk simpan transaksi ke databes
        $trx_model = new TransaksiModel();
        $trx_model->insert($databes);