app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `username` = 'dinand@gmail.com'
AND `passw` = '123'
---
    public function get_data($username, $password)
    {
        return $this->db->table('user')
        ->where(array('username' => $username, 'passw' => $password) )
        ->get()->getRowArray();